Revit 2027 API
FabricationPart.ConnectAndCouple Method
 Makes a connection between the specified connectors and adds coupling if necessary.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool ConnectAndCouple(
	Document document,
	Connector connector,
	Connector toConnector
)
Public Shared Function ConnectAndCouple (
	document As Document,
	connector As Connector,
	toConnector As Connector
) As Boolean
public:
static bool ConnectAndCouple(
	Document^ document,
	Connector^ connector,
	Connector^ toConnector
)
static member ConnectAndCouple :
        document : Document *
        connector : Connector *
        toConnector : Connector -> bool
Parameters
document Document
 The document.
connector Connector
 The connector of the fabrication part.
toConnector Connector
 The connector of the fabrication part or family to connect to.
Return Value
Boolean
 True if connection succeeded, false otherwise.
Exceptions
Exception | Condition
ArgumentException |  The connector does not belong to a fabrication part. -or- The fabrication part connectors are not aligned, call AlignPartByConnectors to align them.
ArgumentNullException |  A non-optional argument was null
Remarks
 This function does not place and align the fabrication part. Call AlignPartByConnectors before connecting.
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace